ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157dxx_cm4.h
/****************  Bit definition for DDRPHYC_DTDR0 register  *****************/
#define DDRPHYC_DTDR0_DTBYTE0_Pos (0U)
#define DDRPHYC_DTDR0_DTBYTE0_Msk (0xFFU << DDRPHYC_DTDR0_DTBYTE0_Pos) /*!< 0x000000FF */
#define DDRPHYC_DTDR0_DTBYTE0     DDRPHYC_DTDR0_DTBYTE0_Msk            /*!< Data Training Data */
#define DDRPHYC_DTDR0_DTBYTE0_0   (0x1U << DDRPHYC_DTDR0_DTBYTE0_Pos)  /*!< 0x00000001 */
#define DDRPHYC_DTDR0_DTBYTE0_1   (0x2U << DDRPHYC_DTDR0_DTBYTE0_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DTDR0_DTBYTE0_2   (0x4U << DDRPHYC_DTDR0_DTBYTE0_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DTDR0_DTBYTE0_3   (0x8U << DDRPHYC_DTDR0_DTBYTE0_Pos)  /*!< 0x00000008 */
#define DDRPHYC_DTDR0_DTBYTE0_4   (0x10U << DDRPHYC_DTDR0_DTBYTE0_Pos) /*!< 0x00000010 */
#define DDRPHYC_DTDR0_DTBYTE0_5   (0x20U << DDRPHYC_DTDR0_DTBYTE0_Pos) /*!< 0x00000020 */
#define DDRPHYC_DTDR0_DTBYTE0_6   (0x40U << DDRPHYC_DTDR0_DTBYTE0_Pos) /*!< 0x00000040 */
#define DDRPHYC_DTDR0_DTBYTE0_7   (0x80U << DDRPHYC_DTDR0_DTBYTE0_Pos) /*!< 0x00000080 */
#define DDRPHYC_DTDR0_DTBYTE1_Pos (8U)
#define DDRPHYC_DTDR0_DTBYTE1_Msk (0xFFU << DDRPHYC_DTDR0_DTBYTE1_Pos) /*!< 0x0000FF00 */
#define DDRPHYC_DTDR0_DTBYTE1     DDRPHYC_DTDR0_DTBYTE1_Msk            /*!< Data Training Data */
#define DDRPHYC_DTDR0_DTBYTE1_0   (0x1U << DDRPHYC_DTDR0_DTBYTE1_Pos)  /*!< 0x00000100 */
#define DDRPHYC_DTDR0_DTBYTE1_1   (0x2U << DDRPHYC_DTDR0_DTBYTE1_Pos)  /*!< 0x00000200 */
#define DDRPHYC_DTDR0_DTBYTE1_2   (0x4U << DDRPHYC_DTDR0_DTBYTE1_Pos)  /*!< 0x00000400 */
#define DDRPHYC_DTDR0_DTBYTE1_3   (0x8U << DDRPHYC_DTDR0_DTBYTE1_Pos)  /*!< 0x00000800 */
#define DDRPHYC_DTDR0_DTBYTE1_4   (0x10U << DDRPHYC_DTDR0_DTBYTE1_Pos) /*!< 0x00001000 */
#define DDRPHYC_DTDR0_DTBYTE1_5   (0x20U << DDRPHYC_DTDR0_DTBYTE1_Pos) /*!< 0x00002000 */
#define DDRPHYC_DTDR0_DTBYTE1_6   (0x40U << DDRPHYC_DTDR0_DTBYTE1_Pos) /*!< 0x00004000 */
#define DDRPHYC_DTDR0_DTBYTE1_7   (0x80U << DDRPHYC_DTDR0_DTBYTE1_Pos) /*!< 0x00008000 */
#define DDRPHYC_DTDR0_DTBYTE2_Pos (16U)
#define DDRPHYC_DTDR0_DTBYTE2_Msk (0xFFU << DDRPHYC_DTDR0_DTBYTE2_Pos) /*!< 0x00FF0000 */
#define DDRPHYC_DTDR0_DTBYTE2     DDRPHYC_DTDR0_DTBYTE2_Msk            /*!< Data Training Data */
#define DDRPHYC_DTDR0_DTBYTE2_0   (0x1U << DDRPHYC_DTDR0_DTBYTE2_Pos)  /*!< 0x00010000 */
#define DDRPHYC_DTDR0_DTBYTE2_1   (0x2U << DDRPHYC_DTDR0_DTBYTE2_Pos)  /*!< 0x00020000 */
#define DDRPHYC_DTDR0_DTBYTE2_2   (0x4U << DDRPHYC_DTDR0_DTBYTE2_Pos)  /*!< 0x00040000 */
#define DDRPHYC_DTDR0_DTBYTE2_3   (0x8U << DDRPHYC_DTDR0_DTBYTE2_Pos)  /*!< 0x00080000 */
#define DDRPHYC_DTDR0_DTBYTE2_4   (0x10U << DDRPHYC_DTDR0_DTBYTE2_Pos) /*!< 0x00100000 */
#define DDRPHYC_DTDR0_DTBYTE2_5   (0x20U << DDRPHYC_DTDR0_DTBYTE2_Pos) /*!< 0x00200000 */
#define DDRPHYC_DTDR0_DTBYTE2_6   (0x40U << DDRPHYC_DTDR0_DTBYTE2_Pos) /*!< 0x00400000 */
#define DDRPHYC_DTDR0_DTBYTE2_7   (0x80U << DDRPHYC_DTDR0_DTBYTE2_Pos) /*!< 0x00800000 */
#define DDRPHYC_DTDR0_DTBYTE3_Pos (24U)
#define DDRPHYC_DTDR0_DTBYTE3_Msk (0xFFU << DDRPHYC_DTDR0_DTBYTE3_Pos) /*!< 0xFF000000 */
#define DDRPHYC_DTDR0_DTBYTE3     DDRPHYC_DTDR0_DTBYTE3_Msk            /*!< Data training data */
#define DDRPHYC_DTDR0_DTBYTE3_0   (0x1U << DDRPHYC_DTDR0_DTBYTE3_Pos)  /*!< 0x01000000 */
#define DDRPHYC_DTDR0_DTBYTE3_1   (0x2U << DDRPHYC_DTDR0_DTBYTE3_Pos)  /*!< 0x02000000 */
#define DDRPHYC_DTDR0_DTBYTE3_2   (0x4U << DDRPHYC_DTDR0_DTBYTE3_Pos)  /*!< 0x04000000 */
#define DDRPHYC_DTDR0_DTBYTE3_3   (0x8U << DDRPHYC_DTDR0_DTBYTE3_Pos)  /*!< 0x08000000 */
#define DDRPHYC_DTDR0_DTBYTE3_4   (0x10U << DDRPHYC_DTDR0_DTBYTE3_Pos) /*!< 0x10000000 */
#define DDRPHYC_DTDR0_DTBYTE3_5   (0x20U << DDRPHYC_DTDR0_DTBYTE3_Pos) /*!< 0x20000000 */
#define DDRPHYC_DTDR0_DTBYTE3_6   (0x40U << DDRPHYC_DTDR0_DTBYTE3_Pos) /*!< 0x40000000 */
#define DDRPHYC_DTDR0_DTBYTE3_7   (0x80U << DDRPHYC_DTDR0_DTBYTE3_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPHYC_DTDR1 register  *****************/
#define DDRPHYC_DTDR1_DTBYTE4_Pos (0U)
#define DDRPHYC_DTDR1_DTBYTE4_Msk (0xFFU << DDRPHYC_DTDR1_DTBYTE4_Pos) /*!< 0x000000FF */
#define DDRPHYC_DTDR1_DTBYTE4     DDRPHYC_DTDR1_DTBYTE4_Msk            /*!< Data Training Data */
#define DDRPHYC_DTDR1_DTBYTE4_0   (0x1U << DDRPHYC_DTDR1_DTBYTE4_Pos)  /*!< 0x00000001 */
#define DDRPHYC_DTDR1_DTBYTE4_1   (0x2U << DDRPHYC_DTDR1_DTBYTE4_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DTDR1_DTBYTE4_2   (0x4U << DDRPHYC_DTDR1_DTBYTE4_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DTDR1_DTBYTE4_3   (0x8U << DDRPHYC_DTDR1_DTBYTE4_Pos)  /*!< 0x00000008 */
#define DDRPHYC_DTDR1_DTBYTE4_4   (0x10U << DDRPHYC_DTDR1_DTBYTE4_Pos) /*!< 0x00000010 */
#define DDRPHYC_DTDR1_DTBYTE4_5   (0x20U << DDRPHYC_DTDR1_DTBYTE4_Pos) /*!< 0x00000020 */
#define DDRPHYC_DTDR1_DTBYTE4_6   (0x40U << DDRPHYC_DTDR1_DTBYTE4_Pos) /*!< 0x00000040 */
#define DDRPHYC_DTDR1_DTBYTE4_7   (0x80U << DDRPHYC_DTDR1_DTBYTE4_Pos) /*!< 0x00000080 */
#define DDRPHYC_DTDR1_DTBYTE5_Pos (8U)
#define DDRPHYC_DTDR1_DTBYTE5_Msk (0xFFU << DDRPHYC_DTDR1_DTBYTE5_Pos) /*!< 0x0000FF00 */
#define DDRPHYC_DTDR1_DTBYTE5     DDRPHYC_DTDR1_DTBYTE5_Msk            /*!< Data Training Data */
#define DDRPHYC_DTDR1_DTBYTE5_0   (0x1U << DDRPHYC_DTDR1_DTBYTE5_Pos)  /*!< 0x00000100 */
#define DDRPHYC_DTDR1_DTBYTE5_1   (0x2U << DDRPHYC_DTDR1_DTBYTE5_Pos)  /*!< 0x00000200 */
#define DDRPHYC_DTDR1_DTBYTE5_2   (0x4U << DDRPHYC_DTDR1_DTBYTE5_Pos)  /*!< 0x00000400 */
#define DDRPHYC_DTDR1_DTBYTE5_3   (0x8U << DDRPHYC_DTDR1_DTBYTE5_Pos)  /*!< 0x00000800 */
#define DDRPHYC_DTDR1_DTBYTE5_4   (0x10U << DDRPHYC_DTDR1_DTBYTE5_Pos) /*!< 0x00001000 */
#define DDRPHYC_DTDR1_DTBYTE5_5   (0x20U << DDRPHYC_DTDR1_DTBYTE5_Pos) /*!< 0x00002000 */
#define DDRPHYC_DTDR1_DTBYTE5_6   (0x40U << DDRPHYC_DTDR1_DTBYTE5_Pos) /*!< 0x00004000 */
#define DDRPHYC_DTDR1_DTBYTE5_7   (0x80U << DDRPHYC_DTDR1_DTBYTE5_Pos) /*!< 0x00008000 */
#define DDRPHYC_DTDR1_DTBYTE6_Pos (16U)
#define DDRPHYC_DTDR1_DTBYTE6_Msk (0xFFU << DDRPHYC_DTDR1_DTBYTE6_Pos) /*!< 0x00FF0000 */
#define DDRPHYC_DTDR1_DTBYTE6     DDRPHYC_DTDR1_DTBYTE6_Msk            /*!< Data Training Data */
#define DDRPHYC_DTDR1_DTBYTE6_0   (0x1U << DDRPHYC_DTDR1_DTBYTE6_Pos)  /*!< 0x00010000 */
#define DDRPHYC_DTDR1_DTBYTE6_1   (0x2U << DDRPHYC_DTDR1_DTBYTE6_Pos)  /*!< 0x00020000 */
#define DDRPHYC_DTDR1_DTBYTE6_2   (0x4U << DDRPHYC_DTDR1_DTBYTE6_Pos)  /*!< 0x00040000 */
#define DDRPHYC_DTDR1_DTBYTE6_3   (0x8U << DDRPHYC_DTDR1_DTBYTE6_Pos)  /*!< 0x00080000 */
#define DDRPHYC_DTDR1_DTBYTE6_4   (0x10U << DDRPHYC_DTDR1_DTBYTE6_Pos) /*!< 0x00100000 */
#define DDRPHYC_DTDR1_DTBYTE6_5   (0x20U << DDRPHYC_DTDR1_DTBYTE6_Pos) /*!< 0x00200000 */
#define DDRPHYC_DTDR1_DTBYTE6_6   (0x40U << DDRPHYC_DTDR1_DTBYTE6_Pos) /*!< 0x00400000 */
#define DDRPHYC_DTDR1_DTBYTE6_7   (0x80U << DDRPHYC_DTDR1_DTBYTE6_Pos) /*!< 0x00800000 */
#define DDRPHYC_DTDR1_DTBYTE7_Pos (24U)
#define DDRPHYC_DTDR1_DTBYTE7_Msk (0xFFU << DDRPHYC_DTDR1_DTBYTE7_Pos) /*!< 0xFF000000 */
#define DDRPHYC_DTDR1_DTBYTE7     DDRPHYC_DTDR1_DTBYTE7_Msk            /*!< Data training data: */
#define DDRPHYC_DTDR1_DTBYTE7_0   (0x1U << DDRPHYC_DTDR1_DTBYTE7_Pos)  /*!< 0x01000000 */
#define DDRPHYC_DTDR1_DTBYTE7_1   (0x2U << DDRPHYC_DTDR1_DTBYTE7_Pos)  /*!< 0x02000000 */
#define DDRPHYC_DTDR1_DTBYTE7_2   (0x4U << DDRPHYC_DTDR1_DTBYTE7_Pos)  /*!< 0x04000000 */
#define DDRPHYC_DTDR1_DTBYTE7_3   (0x8U << DDRPHYC_DTDR1_DTBYTE7_Pos)  /*!< 0x08000000 */
#define DDRPHYC_DTDR1_DTBYTE7_4   (0x10U << DDRPHYC_DTDR1_DTBYTE7_Pos) /*!< 0x10000000 */
#define DDRPHYC_DTDR1_DTBYTE7_5   (0x20U << DDRPHYC_DTDR1_DTBYTE7_Pos) /*!< 0x20000000 */
#define DDRPHYC_DTDR1_DTBYTE7_6   (0x40U << DDRPHYC_DTDR1_DTBYTE7_Pos) /*!< 0x40000000 */
#define DDRPHYC_DTDR1_DTBYTE7_7   (0x80U << DDRPHYC_DTDR1_DTBYTE7_Pos) /*!< 0x80000000 */

/*****************  Bit definition for DDRPHYC_GPR0 register  *****************/
#define DDRPHYC_GPR0_GPR0_Pos (0U)
#define DDRPHYC_GPR0_GPR0_Msk (0xFFFFFFFFU << DDRPHYC_GPR0_GPR0_Pos) /*!< 0xFFFFFFFF */
#define DDRPHYC_GPR0_GPR0     DDRPHYC_GPR0_GPR0_Msk                  /*!< General purpose register 0 bits */
#define DDRPHYC_GPR0_GPR0_0   (0x1U << DDRPHYC_GPR0_GPR0_Pos)        /*!< 0x00000001 */
#define DDRPHYC_GPR0_GPR0_1   (0x2U << DDRPHYC_GPR0_GPR0_Pos)        /*!< 0x00000002 */
#define DDRPHYC_GPR0_GPR0_2   (0x4U << DDRPHYC_GPR0_GPR0_Pos)        /*!< 0x00000004 */
#define DDRPHYC_GPR0_GPR0_3   (0x8U << DDRPHYC_GPR0_GPR0_Pos)        /*!< 0x00000008 */
#define DDRPHYC_GPR0_GPR0_4   (0x10U << DDRPHYC_GPR0_GPR0_Pos)       /*!< 0x00000010 */
#define DDRPHYC_GPR0_GPR0_5   (0x20U << DDRPHYC_GPR0_GPR0_Pos)       /*!< 0x00000020 */
#define DDRPHYC_GPR0_GPR0_6   (0x40U << DDRPHYC_GPR0_GPR0_Pos)       /*!< 0x00000040 */
#define DDRPHYC_GPR0_GPR0_7   (0x80U << DDRPHYC_GPR0_GPR0_Pos)       /*!< 0x00000080 */
#define DDRPHYC_GPR0_GPR0_8   (0x100U << DDRPHYC_GPR0_GPR0_Pos)      /*!< 0x00000100 */
#define DDRPHYC_GPR0_GPR0_9   (0x200U << DDRPHYC_GPR0_GPR0_Pos)      /*!< 0x00000200 */
#define DDRPHYC_GPR0_GPR0_10  (0x400U << DDRPHYC_GPR0_GPR0_Pos)      /*!< 0x00000400 */
#define DDRPHYC_GPR0_GPR0_11  (0x800U << DDRPHYC_GPR0_GPR0_Pos)      /*!< 0x00000800 */
#define DDRPHYC_GPR0_GPR0_12  (0x1000U << DDRPHYC_GPR0_GPR0_Pos)     /*!< 0x00001000 */
#define DDRPHYC_GPR0_GPR0_13  (0x2000U << DDRPHYC_GPR0_GPR0_Pos)     /*!< 0x00002000 */
#define DDRPHYC_GPR0_GPR0_14  (0x4000U << DDRPHYC_GPR0_GPR0_Pos)     /*!< 0x00004000 */
#define DDRPHYC_GPR0_GPR0_15  (0x8000U << DDRPHYC_GPR0_GPR0_Pos)     /*!< 0x00008000 */
#define DDRPHYC_GPR0_GPR0_16  (0x10000U << DDRPHYC_GPR0_GPR0_Pos)    /*!< 0x00010000 */
#define DDRPHYC_GPR0_GPR0_17  (0x20000U << DDRPHYC_GPR0_GPR0_Pos)    /*!< 0x00020000 */
#define DDRPHYC_GPR0_GPR0_18  (0x40000U << DDRPHYC_GPR0_GPR0_Pos)    /*!< 0x00040000 */
#define DDRPHYC_GPR0_GPR0_19  (0x80000U << DDRPHYC_GPR0_GPR0_Pos)    /*!< 0x00080000 */
#define DDRPHYC_GPR0_GPR0_20  (0x100000U << DDRPHYC_GPR0_GPR0_Pos)   /*!< 0x00100000 */
#define DDRPHYC_GPR0_GPR0_21  (0x200000U << DDRPHYC_GPR0_GPR0_Pos)   /*!< 0x00200000 */
#define DDRPHYC_GPR0_GPR0_22  (0x400000U << DDRPHYC_GPR0_GPR0_Pos)   /*!< 0x00400000 */
#define DDRPHYC_GPR0_GPR0_23  (0x800000U << DDRPHYC_GPR0_GPR0_Pos)   /*!< 0x00800000 */
#define DDRPHYC_GPR0_GPR0_24  (0x1000000U << DDRPHYC_GPR0_GPR0_Pos)  /*!< 0x01000000 */
#define DDRPHYC_GPR0_GPR0_25  (0x2000000U << DDRPHYC_GPR0_GPR0_Pos)  /*!< 0x02000000 */
#define DDRPHYC_GPR0_GPR0_26  (0x4000000U << DDRPHYC_GPR0_GPR0_Pos)  /*!< 0x04000000 */
#define DDRPHYC_GPR0_GPR0_27  (0x8000000U << DDRPHYC_GPR0_GPR0_Pos)  /*!< 0x08000000 */
#define DDRPHYC_GPR0_GPR0_28  (0x10000000U << DDRPHYC_GPR0_GPR0_Pos) /*!< 0x10000000 */
#define DDRPHYC_GPR0_GPR0_29  (0x20000000U << DDRPHYC_GPR0_GPR0_Pos) /*!< 0x20000000 */
#define DDRPHYC_GPR0_GPR0_30  (0x40000000U << DDRPHYC_GPR0_GPR0_Pos) /*!< 0x40000000 */
#define DDRPHYC_GPR0_GPR0_31  (0x80000000U << DDRPHYC_GPR0_GPR0_Pos) /*!< 0x80000000 */

/*****************  Bit definition for DDRPHYC_GPR1 register  *****************/
#define DDRPHYC_GPR1_GPR1_Pos (0U)
#define DDRPHYC_GPR1_GPR1_Msk (0xFFFFFFFFU << DDRPHYC_GPR1_GPR1_Pos) /*!< 0xFFFFFFFF */
#define DDRPHYC_GPR1_GPR1     DDRPHYC_GPR1_GPR1_Msk                  /*!< General purpose register 1 bits */
#define DDRPHYC_GPR1_GPR1_0   (0x1U << DDRPHYC_GPR1_GPR1_Pos)        /*!< 0x00000001 */
#define DDRPHYC_GPR1_GPR1_1   (0x2U << DDRPHYC_GPR1_GPR1_Pos)        /*!< 0x00000002 */
#define DDRPHYC_GPR1_GPR1_2   (0x4U << DDRPHYC_GPR1_GPR1_Pos)        /*!< 0x00000004 */
#define DDRPHYC_GPR1_GPR1_3   (0x8U << DDRPHYC_GPR1_GPR1_Pos)        /*!< 0x00000008 */
#define DDRPHYC_GPR1_GPR1_4   (0x10U << DDRPHYC_GPR1_GPR1_Pos)       /*!< 0x00000010 */
#define DDRPHYC_GPR1_GPR1_5   (0x20U << DDRPHYC_GPR1_GPR1_Pos)       /*!< 0x00000020 */
#define DDRPHYC_GPR1_GPR1_6   (0x40U << DDRPHYC_GPR1_GPR1_Pos)       /*!< 0x00000040 */
#define DDRPHYC_GPR1_GPR1_7   (0x80U << DDRPHYC_GPR1_GPR1_Pos)       /*!< 0x00000080 */
#define DDRPHYC_GPR1_GPR1_8   (0x100U << DDRPHYC_GPR1_GPR1_Pos)      /*!< 0x00000100 */
#define DDRPHYC_GPR1_GPR1_9   (0x200U << DDRPHYC_GPR1_GPR1_Pos)      /*!< 0x00000200 */
#define DDRPHYC_GPR1_GPR1_10  (0x400U << DDRPHYC_GPR1_GPR1_Pos)      /*!< 0x00000400 */
#define DDRPHYC_GPR1_GPR1_11  (0x800U << DDRPHYC_GPR1_GPR1_Pos)      /*!< 0x00000800 */
#define DDRPHYC_GPR1_GPR1_12  (0x1000U << DDRPHYC_GPR1_GPR1_Pos)     /*!< 0x00001000 */
#define DDRPHYC_GPR1_GPR1_13  (0x2000U << DDRPHYC_GPR1_GPR1_Pos)     /*!< 0x00002000 */
#define DDRPHYC_GPR1_GPR1_14  (0x4000U << DDRPHYC_GPR1_GPR1_Pos)     /*!< 0x00004000 */
#define DDRPHYC_GPR1_GPR1_15  (0x8000U << DDRPHYC_GPR1_GPR1_Pos)     /*!< 0x00008000 */
#define DDRPHYC_GPR1_GPR1_16  (0x10000U << DDRPHYC_GPR1_GPR1_Pos)    /*!< 0x00010000 */
#define DDRPHYC_GPR1_GPR1_17  (0x20000U << DDRPHYC_GPR1_GPR1_Pos)    /*!< 0x00020000 */
#define DDRPHYC_GPR1_GPR1_18  (0x40000U << DDRPHYC_GPR1_GPR1_Pos)    /*!< 0x00040000 */
#define DDRPHYC_GPR1_GPR1_19  (0x80000U << DDRPHYC_GPR1_GPR1_Pos)    /*!< 0x00080000 */
#define DDRPHYC_GPR1_GPR1_20  (0x100000U << DDRPHYC_GPR1_GPR1_Pos)   /*!< 0x00100000 */
#define DDRPHYC_GPR1_GPR1_21  (0x200000U << DDRPHYC_GPR1_GPR1_Pos)   /*!< 0x00200000 */
#define DDRPHYC_GPR1_GPR1_22  (0x400000U << DDRPHYC_GPR1_GPR1_Pos)   /*!< 0x00400000 */
#define DDRPHYC_GPR1_GPR1_23  (0x800000U << DDRPHYC_GPR1_GPR1_Pos)   /*!< 0x00800000 */
#define DDRPHYC_GPR1_GPR1_24  (0x1000000U << DDRPHYC_GPR1_GPR1_Pos)  /*!< 0x01000000 */
#define DDRPHYC_GPR1_GPR1_25  (0x2000000U << DDRPHYC_GPR1_GPR1_Pos)  /*!< 0x02000000 */
#define DDRPHYC_GPR1_GPR1_26  (0x4000000U << DDRPHYC_GPR1_GPR1_Pos)  /*!< 0x04000000 */
#define DDRPHYC_GPR1_GPR1_27  (0x8000000U << DDRPHYC_GPR1_GPR1_Pos)  /*!< 0x08000000 */
#define DDRPHYC_GPR1_GPR1_28  (0x10000000U << DDRPHYC_GPR1_GPR1_Pos) /*!< 0x10000000 */
#define DDRPHYC_GPR1_GPR1_29  (0x20000000U << DDRPHYC_GPR1_GPR1_Pos) /*!< 0x20000000 */
#define DDRPHYC_GPR1_GPR1_30  (0x40000000U << DDRPHYC_GPR1_GPR1_Pos) /*!< 0x40000000 */
#define DDRPHYC_GPR1_GPR1_31  (0x80000000U << DDRPHYC_GPR1_GPR1_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPHYC_ZQ0CR0 register  ****************/
#define DDRPHYC_ZQ0CR0_ZDATA_Pos   (0U)
#define DDRPHYC_ZQ0CR0_ZDATA_Msk   (0xFFFFFU << DDRPHYC_ZQ0CR0_ZDATA_Pos) /*!< 0x000FFFFF */
#define DDRPHYC_ZQ0CR0_ZDATA       DDRPHYC_ZQ0CR0_ZDATA_Msk               /*!< Impedance override */
#define DDRPHYC_ZQ0CR0_ZDATA_0     (0x1U << DDRPHYC_ZQ0CR0_ZDATA_Pos)     /*!< 0x00000001 */
#define DDRPHYC_ZQ0CR0_ZDATA_1     (0x2U << DDRPHYC_ZQ0CR0_ZDATA_Pos)     /*!< 0x00000002 */
#define DDRPHYC_ZQ0CR0_ZDATA_2     (0x4U << DDRPHYC_ZQ0CR0_ZDATA_Pos)     /*!< 0x00000004 */
#define DDRPHYC_ZQ0CR0_ZDATA_3     (0x8U << DDRPHYC_ZQ0CR0_ZDATA_Pos)     /*!< 0x00000008 */
#define DDRPHYC_ZQ0CR0_ZDATA_4     (0x10U << DDRPHYC_ZQ0CR0_ZDATA_Pos)    /*!< 0x00000010 */
#define DDRPHYC_ZQ0CR0_ZDATA_5     (0x20U << DDRPHYC_ZQ0CR0_ZDATA_Pos)    /*!< 0x00000020 */
#define DDRPHYC_ZQ0CR0_ZDATA_6     (0x40U << DDRPHYC_ZQ0CR0_ZDATA_Pos)    /*!< 0x00000040 */
#define DDRPHYC_ZQ0CR0_ZDATA_7     (0x80U << DDRPHYC_ZQ0CR0_ZDATA_Pos)    /*!< 0x00000080 */
#define DDRPHYC_ZQ0CR0_ZDATA_8     (0x100U << DDRPHYC_ZQ0CR0_ZDATA_Pos)   /*!< 0x00000100 */
#define DDRPHYC_ZQ0CR0_ZDATA_9     (0x200U << DDRPHYC_ZQ0CR0_ZDATA_Pos)   /*!< 0x00000200 */
#define DDRPHYC_ZQ0CR0_ZDATA_10    (0x400U << DDRPHYC_ZQ0CR0_ZDATA_Pos)   /*!< 0x00000400 */
#define DDRPHYC_ZQ0CR0_ZDATA_11    (0x800U << DDRPHYC_ZQ0CR0_ZDATA_Pos)   /*!< 0x00000800 */
#define DDRPHYC_ZQ0CR0_ZDATA_12    (0x1000U << DDRPHYC_ZQ0CR0_ZDATA_Pos)  /*!< 0x00001000 */
#define DDRPHYC_ZQ0CR0_ZDATA_13    (0x2000U << DDRPHYC_ZQ0CR0_ZDATA_Pos)  /*!< 0x00002000 */
#define DDRPHYC_ZQ0CR0_ZDATA_14    (0x4000U << DDRPHYC_ZQ0CR0_ZDATA_Pos)  /*!< 0x00004000 */
#define DDRPHYC_ZQ0CR0_ZDATA_15    (0x8000U << DDRPHYC_ZQ0CR0_ZDATA_Pos)  /*!< 0x00008000 */
#define DDRPHYC_ZQ0CR0_ZDATA_16    (0x10000U << DDRPHYC_ZQ0CR0_ZDATA_Pos) /*!< 0x00010000 */
#define DDRPHYC_ZQ0CR0_ZDATA_17    (0x20000U << DDRPHYC_ZQ0CR0_ZDATA_Pos) /*!< 0x00020000 */
#define DDRPHYC_ZQ0CR0_ZDATA_18    (0x40000U << DDRPHYC_ZQ0CR0_ZDATA_Pos) /*!< 0x00040000 */
#define DDRPHYC_ZQ0CR0_ZDATA_19    (0x80000U << DDRPHYC_ZQ0CR0_ZDATA_Pos) /*!< 0x00080000 */
#define DDRPHYC_ZQ0CR0_ZDEN_Pos    (28U)
#define DDRPHYC_ZQ0CR0_ZDEN_Msk    (0x1U << DDRPHYC_ZQ0CR0_ZDEN_Pos)      /*!< 0x10000000 */
#define DDRPHYC_ZQ0CR0_ZDEN        DDRPHYC_ZQ0CR0_ZDEN_Msk                /*!< Impedance override enable */
#define DDRPHYC_ZQ0CR0_ZCALBYP_Pos (29U)
#define DDRPHYC_ZQ0CR0_ZCALBYP_Msk (0x1U << DDRPHYC_ZQ0CR0_ZCALBYP_Pos)   /*!< 0x20000000 */
#define DDRPHYC_ZQ0CR0_ZCALBYP     DDRPHYC_ZQ0CR0_ZCALBYP_Msk             /*!< Impedance calibration bypass */
#define DDRPHYC_ZQ0CR0_ZCAL_Pos    (30U)
#define DDRPHYC_ZQ0CR0_ZCAL_Msk    (0x1U << DDRPHYC_ZQ0CR0_ZCAL_Pos)      /*!< 0x40000000 */
#define DDRPHYC_ZQ0CR0_ZCAL        DDRPHYC_ZQ0CR0_ZCAL_Msk                /*!< ZCAL trigger */
#define DDRPHYC_ZQ0CR0_ZQPD_Pos    (31U)
#define DDRPHYC_ZQ0CR0_ZQPD_Msk    (0x1U << DDRPHYC_ZQ0CR0_ZQPD_Pos)      /*!< 0x80000000 */
#define DDRPHYC_ZQ0CR0_ZQPD        DDRPHYC_ZQ0CR0_ZQPD_Msk                /*!< ZCAL power down */

/****************  Bit definition for DDRPHYC_ZQ0CR1 register  ****************/
#define DDRPHYC_ZQ0CR1_ZPROG_Pos (0U)
#define DDRPHYC_ZQ0CR1_ZPROG_Msk (0xFFU << DDRPHYC_ZQ0CR1_ZPROG_Pos) /*!< 0x000000FF */
#define DDRPHYC_ZQ0CR1_ZPROG     DDRPHYC_ZQ0CR1_ZPROG_Msk            /*!< Impedance divide ratio to ext R */
#define DDRPHYC_ZQ0CR1_ZPROG_0   (0x1U << DDRPHYC_ZQ0CR1_ZPROG_Pos)  /*!< 0x00000001 */
#define DDRPHYC_ZQ0CR1_ZPROG_1   (0x2U << DDRPHYC_ZQ0CR1_ZPROG_Pos)  /*!< 0x00000002 */
#define DDRPHYC_ZQ0CR1_ZPROG_2   (0x4U << DDRPHYC_ZQ0CR1_ZPROG_Pos)  /*!< 0x00000004 */
#define DDRPHYC_ZQ0CR1_ZPROG_3   (0x8U << DDRPHYC_ZQ0CR1_ZPROG_Pos)  /*!< 0x00000008 */
#define DDRPHYC_ZQ0CR1_ZPROG_4   (0x10U << DDRPHYC_ZQ0CR1_ZPROG_Pos) /*!< 0x00000010 */
#define DDRPHYC_ZQ0CR1_ZPROG_5   (0x20U << DDRPHYC_ZQ0CR1_ZPROG_Pos) /*!< 0x00000020 */
#define DDRPHYC_ZQ0CR1_ZPROG_6   (0x40U << DDRPHYC_ZQ0CR1_ZPROG_Pos) /*!< 0x00000040 */
#define DDRPHYC_ZQ0CR1_ZPROG_7   (0x80U << DDRPHYC_ZQ0CR1_ZPROG_Pos) /*!< 0x00000080 */

/****************  Bit definition for DDRPHYC_ZQ0SR0 register  ****************/
#define DDRPHYC_ZQ0SR0_ZCTRL_Pos (0U)
#define DDRPHYC_ZQ0SR0_ZCTRL_Msk (0xFFFFFU << DDRPHYC_ZQ0SR0_ZCTRL_Pos) /*!< 0x000FFFFF */
#define DDRPHYC_ZQ0SR0_ZCTRL     DDRPHYC_ZQ0SR0_ZCTRL_Msk               /*!< Impedance control */
#define DDRPHYC_ZQ0SR0_ZCTRL_0   (0x1U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)     /*!< 0x00000001 */
#define DDRPHYC_ZQ0SR0_ZCTRL_1   (0x2U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)     /*!< 0x00000002 */
#define DDRPHYC_ZQ0SR0_ZCTRL_2   (0x4U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)     /*!< 0x00000004 */
#define DDRPHYC_ZQ0SR0_ZCTRL_3   (0x8U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)     /*!< 0x00000008 */
#define DDRPHYC_ZQ0SR0_ZCTRL_4   (0x10U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)    /*!< 0x00000010 */
#define DDRPHYC_ZQ0SR0_ZCTRL_5   (0x20U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)    /*!< 0x00000020 */
#define DDRPHYC_ZQ0SR0_ZCTRL_6   (0x40U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)    /*!< 0x00000040 */
#define DDRPHYC_ZQ0SR0_ZCTRL_7   (0x80U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)    /*!< 0x00000080 */
#define DDRPHYC_ZQ0SR0_ZCTRL_8   (0x100U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)   /*!< 0x00000100 */
#define DDRPHYC_ZQ0SR0_ZCTRL_9   (0x200U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)   /*!< 0x00000200 */
#define DDRPHYC_ZQ0SR0_ZCTRL_10  (0x400U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)   /*!< 0x00000400 */
#define DDRPHYC_ZQ0SR0_ZCTRL_11  (0x800U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)   /*!< 0x00000800 */
#define DDRPHYC_ZQ0SR0_ZCTRL_12  (0x1000U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)  /*!< 0x00001000 */
#define DDRPHYC_ZQ0SR0_ZCTRL_13  (0x2000U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)  /*!< 0x00002000 */
#define DDRPHYC_ZQ0SR0_ZCTRL_14  (0x4000U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)  /*!< 0x00004000 */
#define DDRPHYC_ZQ0SR0_ZCTRL_15  (0x8000U << DDRPHYC_ZQ0SR0_ZCTRL_Pos)  /*!< 0x00008000 */
#define DDRPHYC_ZQ0SR0_ZCTRL_16  (0x10000U << DDRPHYC_ZQ0SR0_ZCTRL_Pos) /*!< 0x00010000 */
#define DDRPHYC_ZQ0SR0_ZCTRL_17  (0x20000U << DDRPHYC_ZQ0SR0_ZCTRL_Pos) /*!< 0x00020000 */
#define DDRPHYC_ZQ0SR0_ZCTRL_18  (0x40000U << DDRPHYC_ZQ0SR0_ZCTRL_Pos) /*!< 0x00040000 */
#define DDRPHYC_ZQ0SR0_ZCTRL_19  (0x80000U << DDRPHYC_ZQ0SR0_ZCTRL_Pos) /*!< 0x00080000 */
#define DDRPHYC_ZQ0SR0_ZERR_Pos  (30U)
#define DDRPHYC_ZQ0SR0_ZERR_Msk  (0x1U << DDRPHYC_ZQ0SR0_ZERR_Pos)      /*!< 0x40000000 */
#define DDRPHYC_ZQ0SR0_ZERR      DDRPHYC_ZQ0SR0_ZERR_Msk                /*!< Impedance calibration error */
#define DDRPHYC_ZQ0SR0_ZDONE_Pos (31U)
#define DDRPHYC_ZQ0SR0_ZDONE_Msk (0x1U << DDRPHYC_ZQ0SR0_ZDONE_Pos)     /*!< 0x80000000 */
#define DDRPHYC_ZQ0SR0_ZDONE     DDRPHYC_ZQ0SR0_ZDONE_Msk               /*!< Impedance calibration done */

/****************  Bit definition for DDRPHYC_ZQ0SR1 register  ****************/
#define DDRPHYC_ZQ0SR1_ZPD_Pos (0U)
#define DDRPHYC_ZQ0SR1_ZPD_Msk (0x3U << DDRPHYC_ZQ0SR1_ZPD_Pos) /*!< 0x00000003 */
#define DDRPHYC_ZQ0SR1_ZPD     DDRPHYC_ZQ0SR1_ZPD_Msk           /*!< zpd calibration status */
#define DDRPHYC_ZQ0SR1_ZPD_0   (0x1U << DDRPHYC_ZQ0SR1_ZPD_Pos) /*!< 0x00000001 */
#define DDRPHYC_ZQ0SR1_ZPD_1   (0x2U << DDRPHYC_ZQ0SR1_ZPD_Pos) /*!< 0x00000002 */
#define DDRPHYC_ZQ0SR1_ZPU_Pos (2U)
#define DDRPHYC_ZQ0SR1_ZPU_Msk (0x3U << DDRPHYC_ZQ0SR1_ZPU_Pos) /*!< 0x0000000C */
#define DDRPHYC_ZQ0SR1_ZPU     DDRPHYC_ZQ0SR1_ZPU_Msk           /*!< zpu calibration status */
#define DDRPHYC_ZQ0SR1_ZPU_0   (0x1U << DDRPHYC_ZQ0SR1_ZPU_Pos) /*!< 0x00000004 */
#define DDRPHYC_ZQ0SR1_ZPU_1   (0x2U << DDRPHYC_ZQ0SR1_ZPU_Pos) /*!< 0x00000008 */
#define DDRPHYC_ZQ0SR1_OPD_Pos (4U)
#define DDRPHYC_ZQ0SR1_OPD_Msk (0x3U << DDRPHYC_ZQ0SR1_OPD_Pos) /*!< 0x00000030 */
#define DDRPHYC_ZQ0SR1_OPD     DDRPHYC_ZQ0SR1_OPD_Msk           /*!< opd calibration status */
#define DDRPHYC_ZQ0SR1_OPD_0   (0x1U << DDRPHYC_ZQ0SR1_OPD_Pos) /*!< 0x00000010 */
#define DDRPHYC_ZQ0SR1_OPD_1   (0x2U << DDRPHYC_ZQ0SR1_OPD_Pos) /*!< 0x00000020 */
#define DDRPHYC_ZQ0SR1_OPU_Pos (6U)
#define DDRPHYC_ZQ0SR1_OPU_Msk (0x3U << DDRPHYC_ZQ0SR1_OPU_Pos) /*!< 0x000000C0 */
#define DDRPHYC_ZQ0SR1_OPU     DDRPHYC_ZQ0SR1_OPU_Msk           /*!< opu calibration status */
#define DDRPHYC_ZQ0SR1_OPU_0   (0x1U << DDRPHYC_ZQ0SR1_OPU_Pos) /*!< 0x00000040 */
#define DDRPHYC_ZQ0SR1_OPU_1   (0x2U << DDRPHYC_ZQ0SR1_OPU_Pos) /*!< 0x00000080 */

